Examinator/src/DataProcessors/АктивныеПользователиСУО/АктивныеПользователиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АктивныеПользователиСУО</name>
  <attributes>
    <name>ИнтервалОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/DataProcessors/АктивныеПользователиСУО/Forms/СписокАктивныхПользователей/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура ОбновитьСписокПользователей()
	ЗаполнитьСписокПользователей();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновлениеСпискаПользователей()
	
	Если Объект.ИнтервалОбновления = 0 Тогда
		ОтключитьОбработчикОжидания("ОбновитьСписокПользователей");	
		Возврат;
	КонецЕсли;
		
	ПодключитьОбработчикОжидания("ОбновитьСписокПользователей", Объект.ИнтервалОбновления*60);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПользователей()
	
	УстановитьПривилегированныйРежим(Истина);
	
	АктивныеПользователи.Очистить();
	
	СеансыИнформационнойБазы = ПолучитьСеансыИнформационнойБазы();
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Для Каждого СеансИБ Из СеансыИнформационнойБазы Цикл
		
		Если СеансИБ.Пользователь = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СеансИБ.ИмяПриложения = "Designer" Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеПользователя = НайтиСсылкуПоИдентификаторуПользователя(СеансИБ.Пользователь.УникальныйИдентификатор);
		
		Если ДанныеПользователя = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеПользователя.Пользователь = ТекущийПользователь Тогда
			Продолжить;
		КОнецЕсли;
		
		Если АктивныеПользователи.НайтиСтроки(Новый Структура("Пользователь", ДанныеПользователя.Пользователь)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = АктивныеПользователи.Добавить();
		
		НоваяСтрока.Имя	         = ДанныеПользователя.Имя;
		НоваяСтрока.Пользователь = ДанныеПользователя.Пользователь;
		НоваяСтрока.Картинка     = 0;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиСсылкуПоИдентификаторуПользователя(Идентификатор)
	
	Запрос = Новый Запрос;
	
	ШаблонТекстаЗапроса = "ВЫБРАТЬ
					|	Ссылка, Наименование
					|ИЗ
					|	%1
					|ГДЕ
					|	ИдентификаторПользователяИБ = &Идентификатор";
					
	ТекстЗапросаПоПользователям = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонТекстаЗапроса,
					"Справочник.Пользователи");
	
	ТекстЗапросаПоВнешниемПользователям = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонТекстаЗапроса,
					"Справочник.ВнешниеПользователи");
					
	Запрос.Текст = ТекстЗапросаПоПользователям;
	Запрос.Параметры.Вставить("Идентификатор", Идентификатор);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Новый Структура("Пользователь, Имя", Выборка.Ссылка, Выборка.Наименование);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаПоВнешниемПользователям;
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Новый Структура("Пользователь, Имя", Выборка.Ссылка, Выборка.Наименование);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоУчастияВОбсуждениях = УправлениеДоступом.ЕстьРоль("ЛичныйКабинетУниверсальныйСервисОбщенияСУО");
	
	Элементы.ФормаНаписать.Видимость = ЕстьПравоУчастияВОбсуждениях;
	
	ЗаполнитьСписокПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОбновлениеСпискаПользователей();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписокПользователей();
КонецПроцедуры

&НаКлиенте
Процедура Написать(Команда)
	
	ТекущиеДанные = Элементы.АктивныеПользователи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ТекущиеДанные.Свойство("Пользователь") Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Контекст", ТекущиеДанные.Пользователь);
	ОткрытьФорму("Документ.СообщениеСУО.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура Настроить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьПродолжение", ЭтотОбъект);		
	
	ПоказатьВводЗначения(ОписаниеОповещения, Объект.ИнтервалОбновления, НСтр("ru = 'Интервал обновления в минутах'"));  
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПродолжение(Значение, ДополнительныеПараметры) Экспорт
	
	Объект.ИнтервалОбновления = Значение;
	
	УстановитьОбновлениеСпискаПользователей();
		
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ИнтервалОбновленияПриИзменении(Элемент)
	УстановитьОбновлениеСпискаПользователей();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ АктивныеПользователи

&НаКлиенте
Процедура АктивныеПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ТекущиеДанные.Свойство("Пользователь") Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.Пользователь);
	
КонецПроцедуры
